bit-finance/Reports/бит_ОСВПоЗаписямТрансляцииПриемник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ОСВПоЗаписямТрансляцииПриемник</Name>
		</Properties>
	</Report>
</MetaDataObject>

bit-finance/InformationRegisters/бит_му_СоставПериметровКонсолидации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_СоставПериметровКонсолидации</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКонсолидации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ТипыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолнаяДоляВладения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляНеконтролирующихАкционеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодКонсолидации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_МетодыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсуществляетКонтрольПериметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериметрКонсолидации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_му_ПериметрыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Reports/бит_ОСВПоЗаписямТрансляцииПриемник/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстановитьЗначенияПараметров();
	ПереопределитьНаборыДанных(СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
	
КонецПроцедуры

// Вызывается после перезаполнения панели настроек формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   ПараметрыЗаполнения - Структура - Параметры, которые будут загружены в отчет.
//
Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт

	ЭлементыФормы             = Форма.Элементы;
	ГруппаКомпоновщикНастроек = ЭлементыФормы.Найти("КомпоновщикНастроекПользовательскиеНастройки");
	Если ГруппаКомпоновщикНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаНастройки Из ГруппаКомпоновщикНастроек.ПодчиненныеЭлементы Цикл
		Для каждого ГруппаПараметра Из СтрокаНастройки.ПодчиненныеЭлементы Цикл
			ГруппаЗначение      = ЭлементыФормы.Найти(ГруппаПараметра.Имя + "Значение");
			ГруппаИспользование = ЭлементыФормы.Найти(ГруппаПараметра.Имя + "Использование");
			Если ГруппаЗначение = Неопределено ИЛИ ГруппаИспользование = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ГруппаЗначение.ПодчиненныеЭлементы.Найти("Период1") = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ГруппаИспользование.ПодчиненныеЭлементы[0].Заголовок = НСтр("ru='Период отчета:'");
			Прервать;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрОтчета(ИмяПараметра)
	
	ПараметрНастройки            = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	ПараметрНастройкПользователя = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
									ПараметрНастройки.ИдентификаторПользовательскойНастройки);
	Если ПараметрНастройкПользователя <> Неопределено Тогда
		Возврат ПараметрНастройкПользователя;
	Иначе
		Возврат ПараметрНастройки;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьОписаниеПараметраОтчета(ПараметрыОтчета, ИмяПараметра, Значение, Использование = Истина)
	
	ЗначениеИИспользование = Новый Структура;
	ЗначениеИИспользование.Вставить("Значение",      Значение);
	ЗначениеИИспользование.Вставить("Использование", Использование);
	
	ПараметрыОтчета.Вставить(ИмяПараметра, ЗначениеИИспользование);
	
КонецПроцедуры

Процедура УстановитьЗначенияИПризнакиПараметров(ПараметрыОтчета)
	
	Для каждого ЭлементПараметр Из ПараметрыОтчета Цикл
		ПараметрОтчета         = ПараметрОтчета(ЭлементПараметр.Ключ);
		ЗначениеИИспользование = ЭлементПараметр.Значение;
		
		ПараметрОтчета.Значение      = ЗначениеИИспользование.Значение;
		ПараметрОтчета.Использование = ЗначениеИИспользование.Использование;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначенияПараметров()
	
	ПараметрыОтчета = Новый Структура;
	ЗаполнитьПараметрыПоПравилуЗаполненияПолей(ПараметрыОтчета);
	ЗаполнитьПараметрыПоОрганизации(ПараметрыОтчета);
	УстановитьЗначенияИПризнакиПараметров(ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПоПравилуЗаполненияПолей(ПараметрыОтчета)
	
	ПараметрПравилаЗаполненияПолей = ПараметрОтчета("ПравилаЗаполненияПолей");
	ПравилаЗаполненияПолей         = ПараметрПравилаЗаполненияПолей.Значение;
	ПараметрыПравилаЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПравилаЗаполненияПолей, "Источник, Приемник");
	ДобавитьОписаниеПараметраОтчета(ПараметрыОтчета, "Источник", ПараметрыПравилаЗаполнения.Источник);
	ДобавитьОписаниеПараметраОтчета(ПараметрыОтчета, "Приемник", ПараметрыПравилаЗаполнения.Приемник);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПоОрганизации(ПараметрыОтчета)
	
	ПараметрОрганизация = ПараметрОтчета("ПараметрОрганизация");
	ЗначениеОтбора      = Новый СписокЗначений;
	ИспользоватьОтбор   = Ложь;
	
	Организация         = ПараметрОрганизация.Значение;
	Если ПараметрОрганизация.Использование И ЗначениеЗаполнено(Организация) Тогда
		ИспользоватьОтбор = Истина;
		ЗначениеОтбора    = ОрганизацииПоОтбору(Организация);
	КонецЕсли;
		
	ДобавитьОписаниеПараметраОтчета(ПараметрыОтчета, "ОтборОрганизации", ЗначениеОтбора, ИспользоватьОтбор);
	
КонецПроцедуры
		
Функция ОрганизацииПоОтбору(ЗначениеОтбора)
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Организации") Тогда
		Возврат ЗначениеОтбора;
	КонецЕсли;
	
	ОрганизацииПоОтбору = Новый СписокЗначений;
	
	ПериодОтчета = ПараметрОтчета("ПериодОтчета").Значение;
	КонецПериода = КонецДня(ПериодОтчета.ДатаОкончания);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставПериметровКонсолидации.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметровКонсолидации
	|ГДЕ
	|	(СоставПериметровКонсолидации.ДатаОкончания >= &КонецПериода
	|			ИЛИ СоставПериметровКонсолидации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))";
	Запрос.УстановитьПараметр("ПериметрКонсолидации", ЗначениеОтбора);
	Запрос.УстановитьПараметр("КонецПериода",         КонецПериода);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОрганизацииПоОтбору;
	КонецЕсли;
	
	МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Организация");
	ОрганизацииПоОтбору.ЗагрузитьЗначения(МассивОрганизаций);
	Возврат ОрганизацииПоОтбору;
	
КонецФункции		

Процедура ПереопределитьНаборыДанных(СтандартнаяОбработка)
	
	Источник = ПараметрОтчета("Источник").Значение;
	Приемник = ПараметрОтчета("Приемник").Значение;
	
	Если Источник.Родитель <> Справочники.бит_ОбъектыСистемы.РегистрыБухгалтерии
		ИЛИ Приемник.Родитель <> Справочники.бит_ОбъектыСистемы.РегистрыБухгалтерии Тогда
		ТекстСообщения = НСтр("ru='В правилах заполнения полей можно выбирать только правила трансляции между регистрами бухгалтерии.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СхемаПоУмолчанию            = Отчеты.бит_ОСВПоЗаписямТрансляцииПриемник.ПолучитьМакет(
									"ОсновнаяСхемаКомпоновкиДанных");
	ТекстЗапросаОстаткиИОбороты = СхемаПоУмолчанию.НаборыДанных.ОстаткиИОбороты.Запрос;
	ТекстЗапросаТрансляция      = СхемаПоУмолчанию.НаборыДанных.Трансляция.Запрос;
	
	Если Источник.ИмяОбъекта <> "Хозрасчетный" Тогда
		ТекстЗапросаТрансляция = СтрЗаменить(ТекстЗапросаТрансляция, "Хозрасчетный", "РегистрБухгалтерииИсточник");
	КонецЕсли;
	ИмяРесурсаИсточника = ИмяРасчетногоРесурса(Источник);
	ТекстЗапросаТрансляция = СтрЗаменить(ТекстЗапросаТрансляция,
										"ИсточникПереопределяемый.Сумма",
										"ИсточникПереопределяемый." + ИмяРесурсаИсточника);
	
	ТекстЗапросаТрансляция = СтрЗаменить(ТекстЗапросаТрансляция, "бит_Дополнительный_2", "РегистрБухгалтерииПриемник");
	Если Приемник.ИмяОбъекта <> "Хозрасчетный" Тогда
		ТекстЗапросаОстаткиИОбороты = СтрЗаменить(ТекстЗапросаОстаткиИОбороты, "Хозрасчетный", "РегистрБухгалтерииПриемник");
	КонецЕсли;
	ИмяРесурсаПриемника = ИмяРасчетногоРесурса(Приемник);
	ТекстЗапросаТрансляция = СтрЗаменить(ТекстЗапросаТрансляция,
										"ПриемникПереопределяемый.СуммаРегл",
										"ПриемникПереопределяемый." + ИмяРесурсаПриемника);
	ТекстЗапросаОстаткиИОбороты = СтрЗаменить(ТекстЗапросаОстаткиИОбороты,
										"ТаблицаАнализаОстаткиИОборотыПереопределяемый.Сумма",
										"ТаблицаАнализаОстаткиИОборотыПереопределяемый." + ИмяРесурсаПриемника);
		
	ТекстЗапросаОстаткиИОбороты = СтрЗаменить(ТекстЗапросаОстаткиИОбороты, "РегистрБухгалтерииПриемник", Приемник.ИмяОбъекта);
	ТекстЗапросаТрансляция      = СтрЗаменить(ТекстЗапросаТрансляция, "РегистрБухгалтерииИсточник", Источник.ИмяОбъекта);
	ТекстЗапросаТрансляция      = СтрЗаменить(ТекстЗапросаТрансляция, "РегистрБухгалтерииПриемник", Приемник.ИмяОбъекта);
	
	СхемаКомпоновкиДанных.НаборыДанных.ОстаткиИОбороты.Запрос = ТекстЗапросаОстаткиИОбороты;
	СхемаКомпоновкиДанных.НаборыДанных.Трансляция.Запрос      = ТекстЗапросаТрансляция;
	
КонецПроцедуры

Функция ИмяРасчетногоРесурса(ОбъектСистемы)
	
	МетаданныОбъекта = Справочники.бит_ОбъектыСистемы.ОбъектМетаданныхПоОбъектуСистемы(ОбъектСистемы);
	РесурсыОбъекта   = МетаданныОбъекта.Ресурсы;
	
	Если РесурсыОбъекта.Найти("Сумма") <> Неопределено Тогда
		Возврат "Сумма";
	КонецЕсли;
	
	Если РесурсыОбъекта.Найти("СуммаРегл") <> Неопределено Тогда
		Возврат "СуммаРегл";
	КонецЕсли;
	
	Возврат РесурсыОбъекта[0].Имя;
	
КонецФункции

#КонецОбласти

#КонецЕсли
